app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(sanitized_params)
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Advisory"], ["room_number", 201], ["created_at", "2020-10-30 16:58:34.026197"], ["updated_at", "2020-10-30 16:58:34.026197"]]

    def update
        @school_class.update(sanitized_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 503], ["updated_at", "2020-10-30 16:59:31.220723"], ["id", 3]]