app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Alec"], ["last_name", "Grey"], ["created_at", "2020-10-30 00:31:09.918743"], ["updated_at", "2020-10-30 00:31:09.918743"]]
---
    def create
        @student = Student.create(sanitized_params)

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Xander"], ["updated_at", "2020-10-30 00:38:25.769673"], ["id", 3]]
---
    def update
        @student.update(sanitized_params)